Router#en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname RA
RA(config)#inter
% Incomplete command.
RA(config)#interface fa
% Incomplete command.
RA(config)#interface fastEthernet 0/0
RA(config-if)#ip address 192.168.1.254 255.255.255.0
RA(config-if)#no shutdown

RA(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

RA(config-if)#exit
RA(config)#interface serial 0/0/0
RA(config-if)#

RA#
RA#
RA#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
RA(config)#router rip
RA(config-router)#network 192.168.1.0 
RA(config-router)#network 192.168.2.0 
RA(config-router)#exit
RA(config)#exit
RA#
%SYS-5-CONFIG_I: Configured from console by console
copy running-config startup-config
Destination filename [startup-config]? 
Building configuration...
[OK]